SE4Foam/tutorials/buoyantBoussinesqSimple4SEFoam/solarChimney/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		uniform 300.0;
    }

    outlet
    {
	type		zeroGradient;
    }

    left
    {
	/*type		fixedValue;
	value		uniform 365.0;*/
	type                    robin4SEFoam;
	Kappa                   kappaEff;
	qo                      (1000);
	ho                      (5.0);
	To                      (300.0);
    }

    right
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
