SE4Foam/tutorials/buoyantBoussinesqSimple4SEFoam/solarChimney/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	/*type		fixedValue;
	value		uniform (0 1e-8 0);*/

	type		inletOutlet;
        inletValue	uniform (0 0 0);
        value		uniform (0 0 0);
    }

    outlet
    {
	type		zeroGradient;
    }

    left
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }

    right
    {
	type		fixedValue;
	value		uniform (0 0 0);
    }
}


// ************************************************************************* //
